[
  {
    "author": "ABC News +1",
    "message": "🇺🇸 BREAKING: U.S. President Donald Trump announces that U.S. forces have conducted a large-scale strike in Venezuela and that President Nicolás Maduro has been captured, alongside his wife, Cilia Flores."
  },
  {
    "author": "Al Jazeera",
    "message": "Explosions are reported over Caracas early this morning as the U.S. assault begins, signaling an unprecedented direct action on Venezuelan soil."
  },
  {
    "author": "ABC News",
    "message": "Trump states the operation was \"successful\" and conducted with U.S. law enforcement cooperation; details remain limited."
  },
  {
    "author": "ABC News",
    "message": "Maduro and Flores are reportedly flown out of Venezuela after capture."
  },
  {
    "author": "CBS News",
    "message": "Venezuelan authorities immediately condemn the action as a kidnapping and violation of sovereignty."
  },
  {
    "author": "Reuters",
    "message": "The U.S. government says Maduro will face criminal charges in the United States."
  },
  {
    "author": "Reuters",
    "message": "Reuters reports this marks the most direct U.S. military intervention in Latin America since the 1989 Panama invasion."
  },
  {
    "author": "Le Monde.fr",
    "message": "Venezuelan military leadership is reported mobilized across the country following the strike."
  },
  {
    "author": "AP News",
    "message": "Supreme Tribunal of Justice in Venezuela declares Vice President Delcy Rodríguez acting president amid the chaos."
  },
  {
    "author": "Le Monde.fr",
    "message": "U.S. jets and military aircraft are seen flying over Caracas; civilians shelter as the operation unfolds."
  },
  {
    "author": "Wikipedia",
    "message": "Reuters notes the operation was part of \"Operation Absolute Resolve\", a long-planned effort according to sources."
  },
  {
    "author": "Al Jazeera",
    "message": "Images and reports show smoke rising over Venezuelan airbases after U.S. air activity."
  },
  {
    "author": "CBS News",
    "message": "Venezuelan officials demand immediate Maduro proof of life and refute U.S. claims of a lawful arrest."
  },
  {
    "author": "The Guardian",
    "message": "U.S. Republicans laud the strike and arrest, calling it enforcement of indictments for narco-terrorism and drug trafficking."
  },
  {
    "author": "The Guardian",
    "message": "Democratic lawmakers condemn the unilateral action as a dangerous act without congressional approval."
  },
  {
    "author": "The Washington Post",
    "message": "Calls mount in Washington about legality and potential overreach of U.S. military power."
  },
  {
    "author": "Reuters",
    "message": "Experts question under international law whether the capture of a sitting head of state can be justified."
  },
  {
    "author": "The Guardian",
    "message": "Some U.S. senators warn the precedent could destabilize global norms and invite retaliation."
  },
  {
    "author": "Reuters",
    "message": "Debate intensifies in Congress over war powers and executive authority."
  },
  {
    "author": "Reuters",
    "message": "Reuters: Trump says the U.S. might launch a second strike if Venezuela's new authorities don't cooperate."
  },
  {
    "author": "Reuters",
    "message": "International legal experts call the mission \"legally incoherent\" and warn about consequences for international order."
  },
  {
    "author": "Chatham House",
    "message": "Global legal analysis suggests unilateral abduction of a foreign leader could violate international law."
  },
  {
    "author": "Al Jazeera",
    "message": "The United Nations Security Council is reportedly preparing to address the crisis."
  },
  {
    "author": "The Guardian",
    "message": "Cuba condemns the action as \"state terrorism\", recalling historic U.S. interventions in the region."
  },
  {
    "author": "Reuters",
    "message": "Reuters reports that Cuba says 32 Cuban citizens were killed in the operation."
  },
  {
    "author": "Al Jazeera",
    "message": "Latin American governments are split; some condemn the U.S., others are cautious or silent."
  },
  {
    "author": "New York Post",
    "message": "Venezuelan diaspora communities in the U.S. react with mixed emotions, some celebrating Maduro's removal."
  },
  {
    "author": "AP News",
    "message": "Venezuelan interim leader Delcy Rodríguez initially rejects the new status and demands Maduro's release."
  },
  {
    "author": "AP News",
    "message": "Rodríguez later signals a willingness to negotiate with the U.S. under pressure, sources say."
  },
  {
    "author": "Le Monde.fr",
    "message": "Reports indicate Venezuelan streets in Caracas are eerily calm and tense in the aftermath."
  },
  {
    "author": "The Guardian",
    "message": "Maduro and Flores are scheduled to appear in a Manhattan federal court on drug and weapons charges."
  },
  {
    "author": "The Guardian",
    "message": "Footage circulates showing Maduro in handcuffs arriving in New York."
  },
  {
    "author": "The Guardian",
    "message": "U.S. prosecutors update indictments, alleging narco-terrorism and cocaine conspiracies."
  },
  {
    "author": "The Washington Post",
    "message": "Legal scholars predict the capture won't stop U.S. courts from proceeding with prosecution."
  },
  {
    "author": "New York Post",
    "message": "Debate heats in the U.S. about whether economic motives like oil influenced the decision."
  },
  {
    "author": "New York Post",
    "message": "Former U.S. officials call the capture \"unlawful and unwise\", saying it threatens regional stability."
  },
  {
    "author": "AP News",
    "message": "Venezuelan military leaders outside Caracas resist U.S. claims of full control."
  },
  {
    "author": "Reuters",
    "message": "International human rights groups demand civilian protection and political solutions."
  },
  {
    "author": "Reuters",
    "message": "Cuban government declares days of mourning for its fallen personnel."
  },
  {
    "author": "The Guardian",
    "message": "The Guardian notes significant backlash and concern from global leaders over precedent."
  },
  {
    "author": "The Washington Post",
    "message": "Journalists ask: What does Maduro's capture signal for U.S.-Latin America relations?"
  },
  {
    "author": "Chatham House",
    "message": "Some analysts note the operation dramatically escalates U.S. extraterritorial intervention tactics."
  },
  {
    "author": "Chatham House",
    "message": "Critics warn the move could weaken international norms against invading sovereign nations."
  },
  {
    "author": "Wikipedia",
    "message": "Venezuela's next presidential election landscape reshapes under the interim government."
  },
  {
    "author": "Reuters",
    "message": "Newsrooms worldwide shift coverage to long-term geopolitical repercussions."
  },
  {
    "author": "WIRED",
    "message": "Reports highlight disinformation surges on social platforms following the news."
  },
  {
    "author": "WIRED",
    "message": "Fact-checkers work to debunk misleading videos and AI-generated content related to the raid."
  },
  {
    "author": "The Guardian",
    "message": "U.S. coverage emphasizes national security narratives tied to drugs and crime."
  },
  {
    "author": "Wikipedia",
    "message": "International press outlets question whether the U.S. can legally govern Venezuela post-capture."
  },
  {
    "author": "New York Post",
    "message": "Ongoing reporting will focus on diasporic Venezuelan communities and their futures."
  }
]