[
  {"author": "BNO News", "message": "BREAKING: Reports of heavy explosions and low-flying aircraft over Caracas, Venezuela. Local residents reporting power outages and intense military activity near Fort Tiuna."},
  {"author": "Caitlin Dickerson (The Atlantic)", "message": "Sources in Caracas describe a 'coordinated assault' on government buildings. The scale of the air activity suggests a major foreign intervention is underway."},
  {"author": "RealDonaldTrump (Truth Social)", "message": "A GREAT DAY FOR FREEDOM! At my direction, U.S. forces have captured the outlaw dictator Nicolas Maduro and his wife in Caracas. They are currently in U.S. custody. More to follow!"},
  {"author": "AP Central Am", "message": "URGENT: President Trump announces the capture of Nicolas Maduro during a midnight raid in the Venezuelan capital. Operation codenamed 'Absolute Resolve.'"},
  {"author": "CNN Breaking News", "message": "U.S. Department of War confirms Maduro and Cilia Flores were extracted by Delta Force and CIA operatives. No U.S. casualties reported in the mission."},
  {"author": "Marco Rubio (SecState)", "message": "The days of the Maduro crime family are over. Justice is coming for the people of Venezuela. The U.S. will assist in a peaceful transition to legitimate governance."},
  {"author": "Reuters World", "message": "Venezuelan VP Delcy Rodriguez denounces Maduro's capture as an 'imperialist kidnapping' and calls for immediate international condemnation."},
  {"author": "The New York Times", "message": "Pentagon officials say over 150 aircraft were involved in 'Operation Absolute Resolve' to provide cover for the ground extraction of the Venezuelan leader."},
  {"author": "BBC News (World)", "message": "Unconfirmed reports suggest over 80 people were killed during the U.S. raid in Caracas, including Venezuelan security officers and Cuban military advisors."},
  {"author": "Edward Helmore (The Guardian)", "message": "Maduro is reportedly being flown to New York City to face a 2020 narco-terrorism indictment. This is the first time the US has captured a sitting head of state since Noriega."},
  {"author": "Fox News Politics", "message": "Secretary of War Pete Hegseth: 'This is America First; this is peace through strength.' Hegseth confirms Maduro is currently aboard the USS Iwo Jima."},
  {"author": "AFP News Agency", "message": "PHOTO: President Trump shares image of a blindfolded, handcuffed Nicolas Maduro in a gray sweatsuit aboard a U.S. Navy vessel."},
  {"author": "Pam Bondi (Attorney General)", "message": "The Department of Justice has unsealed a new indictment against Maduro and Flores for cocaine importation and possession of destructive devices. They will face the full wrath of American justice."},
  {"author": "Al Jazeera English", "message": "China and Russia condemn the U.S. military action in Venezuela, calling it a 'flagrant violation' of international law and Venezuelan sovereignty."},
  {"author": "The Wall Street Journal", "message": "Trump signals U.S. oil companies will be sent to Venezuela to 'rebuild and manage' the nation's nationalized oil industry following Maduro's removal."},
  {"author": "CNBC Breaking", "message": "Oil markets react sharply to Venezuela news. WTI crude fluctuates as traders weigh the potential for U.S. control over Venezuelan reserves."},
  {"author": "NBC News", "message": "Protests erupt outside the White House and the UN Plaza in San Francisco against the U.S. bombing of Caracas and the seizure of Maduro."},
  {"author": "El Nacional (Venezuela)", "message": "Tensions high in Caracas as supporters of the PSUV gather to protest the 'abduction' of Maduro. Security forces' loyalty remains divided."},
  {"author": "CBS News", "message": "Law enforcement sources say Maduro's plane has landed at Stewart Air National Guard Base in New York. He is being moved to Manhattan via helicopter."},
  {"author": "ABC News", "message": "Crowds gather outside the Metropolitan Detention Center in Brooklyn as an armored convoy arrives carrying the deposed Venezuelan leader."},
  {"author": "Washington Post", "message": "Legal experts question the 'self-defense' justification for the raid, noting no prior armed attack by Venezuela occurred before the U.S. strikes."},
  {"author": "Christian Amanpour (CNN)", "message": "The capture of Maduro is a massive blow to Russian influence in the Western Hemisphere. Putin's most prominent Latin American ally is now in a New York jail cell."},
  {"author": "The Hill", "message": "Democrats in Congress split: many who previously called for Maduro's ouster now criticize Trump's 'unauthorized' use of military force."},
  {"author": "Miami Herald", "message": "Celebrations in Doral, Florida. The Venezuelan diaspora reacts with joy to the news of Maduro's capture after years of exile."},
  {"author": "VICE News", "message": "Inside 'Operation Absolute Resolve': Sources say the mission was months in the making, involving detailed rehearsals of the breach at Fort Tiuna."},
  {"author": "The Guardian", "message": "Indictment alleges Maduro and the 'Cartel of the Suns' ran a corrupt patronage system that flooded the US with thousands of tons of cocaine."},
  {"author": "Politico", "message": "Speaker Mike Johnson briefs House on Venezuela; says no plans for long-term U.S. troop deployment, but 'operational control' is the goal for now."},
  {"author": "Telemundo News", "message": "Cilia Flores, Maduro's wife, also faces life in prison. Allegations include accepting bribes to facilitate drug meetings in 2007."},
  {"author": "Bloomberg Politics", "message": "US Ambassador Mike Waltz tells UN Security Council the raid was a 'surgical law enforcement operation' against fugitives of justice."},
  {"author": "Sky News Breaking", "message": "UN Secretary-General expresses 'grave concern' over the escalation in Venezuela and the status of international law following the U.S. intervention."},
  {"author": "CBC News", "message": "Timeline of escalation: U.S. pressure had been building since September 2025 with strikes on suspected narco-boats in the Caribbean."},
  {"author": "Le Monde in English", "message": "European leaders remain cautious. France and Germany call for a return to democratic order but stop short of endorsing the military capture."},
  {"author": "The Independent", "message": "Trump administration officials say Delcy Rodriguez is the 'interim' contact point in Caracas, despite her earlier denunciations of the U.S."},
  {"author": "NPR Politics", "message": "The 'Noriega Precedent': How the U.S. is using the 1989 Panama invasion as a legal blueprint for the prosecution of Nicolas Maduro."},
  {"author": "MSNBC", "message": "New DOJ indictment does not refer to 'Cartel of the Suns' as an organized group, but as a 'corrupt patronage system' within the Venezuelan state."},
  {"author": "USA Today", "message": "Federal marshals increase security at the Southern District of New York (SDNY) ahead of Maduro's expected arraignment."},
  {"author": "The Daily Beast", "message": "Sources: Maduro's son, Nicolasito, remains at large. U.S. bounty on top Venezuelan officials remains active."},
  {"author": "Daily Mail Online", "message": "Inside the cell: Maduro reported to be held in high-security wing of MDC Brooklyn, the same facility that held Ghislaine Maxwell and Sam Bankman-Fried."},
  {"author": "Vox News", "message": "Explained: Why the U.S. claims Maduro's 2024 election win was fraudulent, providing the political cover for 'Absolute Resolve.'"},
  {"author": "HuffPost", "message": "Human rights groups warn of a power vacuum in Venezuela as U.S. forces maintain a 'security perimeter' around key oil infrastructure."},
  {"author": "New York Post", "message": "MADURO IN MANHATTAN: The dictator arrives at court. Heavy police presence blocks off Worth Street for the high-profile prisoner transfer."},
  {"author": "CNN World", "message": "Maduro appears in court wearing blue jail scrubs. He reportedly told the judge: 'I am a prisoner of war... I am a decent man.'"},
  {"author": "BBC Breaking", "message": "Nicolás Maduro pleads NOT GUILTY to all charges, including narco-terrorism and cocaine importation, in a Manhattan federal court."},
  {"author": "The Guardian World", "message": "Lawyers for Cilia Flores say she sustained 'broken ribs' during the U.S. military extraction and requires urgent medical attention."},
  {"author": "Reuters Legal", "message": "Judge Alvin Hellerstein orders Maduro to be held without bail. Next hearing set for March 17, 2026."},
  {"author": "TIME", "message": "The end of the Bolivarian Revolution? With Maduro in a U.S. prison, Venezuela faces its most uncertain chapter since the rise of Hugo Chavez."},
  {"author": "Atlantic Council", "message": "Analysis: The capture of Maduro marks a radical shift in U.S. foreign policy toward 'direct kinetic enforcement' of domestic indictments abroad."},
  {"author": "Newsweek", "message": "Polls show 62% of Americans support the capture of Maduro, but 55% are concerned about a potential long-term military entanglement in Venezuela."},
  {"author": "Financial Times", "message": "Trump tells reporters on Air Force One: 'We're going to make Venezuela great again. Their oil will pay for the rebuilding.'"},
  {"author": "AP News", "message": "As of Jan 6, 2026, Maduro remains in U.S. custody. The world watches Caracas to see if the military will hold or if the government will collapse entirely."}
]