[
  {"author": "@AP", "message": "BREAKING: Loud explosions reported in Caracas near Fort Tiuna. Unconfirmed reports of U.S. aircraft over the Venezuelan capital. #Venezuela"},
  {"author": "@ReutersWorld", "message": "Witnesses in Caracas report heavy gunfire and several low-flying helicopters near the presidential residence. Communication lines appearing to flicker. #Caracas"},
  {"author": "@MarocRubio", "message": "Justice is coming. #OperationAbsoluteResolve"},
  {"author": "@TheGuardian", "message": "Venezuelan Vice President Delcy Rodríguez denounces 'brazen aggression' as reports of a U.S.-led raid on President Maduro's residence circulate."},
  {"author": "@CNNBrk", "message": "President Donald Trump announces the capture of Nicolás Maduro in a successful overnight military extraction in Caracas. #MaduroCaptured"},
  {"author": "@WhiteHouse", "message": "President Trump: 'Last night, at my direction, U.S. forces conducted a surgical operation to bring outlaw dictator Nicolás Maduro to justice.'"},
  {"author": "@DeptofWar", "message": "Operation Absolute Resolve: U.S. Army Delta Force and CIA operatives successfully extracted Nicolás Maduro and wife Cilia Flores from Caracas. No U.S. casualties reported."},
  {"author": "@DonaldTrump", "message": "Maduro is in custody! We are going to run Venezuela properly and get the oil flowing again. A great day for the hemisphere!"},
  {"author": "@Reuters", "message": "Trump posts photo of a blindfolded Nicolás Maduro in a gray sweatsuit aboard the USS Iwo Jima. #Venezuela"},
  {"author": "@AP_Politics", "message": "Attorney General Pam Bondi announces superseding indictment against Maduro and Flores for narco-terrorism and cocaine importation. #JusticeDept"},
  {"author": "@BBCWorld", "message": "World leaders react: Brazil’s Lula calls the U.S. raid a 'dangerous precedent'; Argentina’s Milei hails the end of a 'bloody dictatorship.'"},
  {"author": "@ABC", "message": "U.S. Secretary of State Marco Rubio: 'Maduro is the head of a narco-terror organization. He will now face the full wrath of American justice.'"},
  {"author": "@nytimes", "message": "Analysis: Trump’s move to 'run' Venezuela marks a radical shift in U.S. foreign policy, echoing 19th-century interventionism. #Venezuela"},
  {"author": "@WSJ", "message": "Oil markets volatile as Trump signals U.S. companies will take control of Venezuelan oil infrastructure to 'modernize' it. #OPEC #Oil"},
  {"author": "@CBSNews", "message": "Exclusive: U.S. military officials say over 150 aircraft were involved in the Venezuelan operation to provide cover for ground teams."},
  {"author": "@UN_News", "message": "UN Secretary-General Guterres 'deeply alarmed' by U.S. military action in Venezuela; calls for respect of international law."},
  {"author": "@MariaCorinaYA", "message": "A new dawn for Venezuela. We thank the United States for their bravery in ending the usurpation. #Libertad"},
  {"author": "@MSNBC", "message": "Sen. Tim Kaine criticizes 'unauthorized attack' on Venezuela, says Trump put American servicemembers at risk without Congressional approval."},
  {"author": "@FoxNews", "message": "Senate Majority Leader John Thune praises 'decisive action' in Maduro's capture, says world is safer without the narco-regime."},
  {"author": "@ReutersLatam", "message": "Protests break out in Rio de Janeiro and Mexico City against U.S. intervention in Venezuela. #HandsOffVenezuela"},
  {"author": "@TheHill", "message": "Trump on Air Force One: 'It's our hemisphere. We’re in the business of having countries around us that are viable.'"},
  {"author": "@AP_Courts", "message": "A plane carrying Nicolás Maduro and Cilia Flores has landed at Stewart Air National Guard Base in New York. Heavy security present."},
  {"author": "@NYDailyNews", "message": "Maduro arrives in NYC. The former strongman was seen being led into a hangar by federal agents before a helicopter transfer to Manhattan."},
  {"author": "@WNYC", "message": "NYPD and Federal agents block off streets around the Metropolitan Detention Center in Brooklyn where Maduro is expected to be held."},
  {"author": "@DailyMail", "message": "Pictured: Cilia Flores seen with large bandages on her face following the chaotic extraction from Caracas. #Maduro"},
  {"author": "@Just_Security", "message": "Legal experts debate 'Head of State' immunity as Maduro prepares for his first U.S. court appearance. #InternationalLaw"},
  {"author": "@SkyNews", "message": "Reports from Caracas: At least 80 killed during 'Operation Absolute Resolve,' according to unnamed Venezuelan officials. #Venezuela"},
  {"author": "@AlJazeera_World", "message": "Iran and Russia condemn Maduro's 'abduction,' calling it a violation of sovereignty and international norms."},
  {"author": "@Bloomberg", "message": "U.S. stocks tied to energy and defense see gains following the successful raid in Venezuela. #Markets"},
  {"author": "@TIME", "message": "Inside the raid: Delta Force operatives utilized months of intelligence and naval blockades to isolate the Maduro residence. #CoverStory"},
  {"author": "@ViceNews", "message": "Clashes reported outside the Manhattan federal courthouse between pro-Maduro protesters and members of the Venezuelan diaspora."},
  {"author": "@ReutersWorld", "message": "Monday Morning: Nicolás Maduro and Cilia Flores arrive at federal court in Manhattan under heavy armored escort."},
  {"author": "@VictoriaBekiempis", "message": "I’m inside the courtroom. Maduro is wearing khaki pants and a blue shirt. He just shouted 'Happy New Year!' to the gallery in English."},
  {"author": "@TheGuardian", "message": "Maduro appears in court in ankle shackles. He tells the judge through a translator: 'I am a prisoner of war. I am still the President.'"},
  {"author": "@AP", "message": "BREAKING: Nicolás Maduro and Cilia Flores plead not guilty to narco-terrorism and weapons charges in New York federal court."},
  {"author": "@CNNBrk", "message": "Judge Alvin Hellerstein orders Maduro to remain held without bail. Next hearing set for March 17. #MaduroTrial"},
  {"author": "@ABCWorldNews", "message": "Maduro's lawyer calls the capture a 'military abduction' and vows to challenge the legality of the U.S. jurisdiction."},
  {"author": "@CBSNews", "message": "Trump administration officials say they are already in talks with 'legitimate' Venezuelan figures to begin the transition of power."},
  {"author": "@NBCNews", "message": "White House signals it may subsidize U.S. energy firms to rebuild Venezuela's oil infrastructure within 18 months."},
  {"author": "@ReutersWorld", "message": "Acting Venezuelan leader Delcy Rodríguez calls for 'peaceful coexistence' despite the capture of her predecessor. #Venezuela"},
  {"author": "@Politico", "message": "GOP lawmakers push for immediate recognition of a new Venezuelan government following Maduro's arraignment."},
  {"author": "@TheEconomist", "message": "The Maduro Vacuum: With the strongman in a Brooklyn cell, who actually controls the Venezuelan military today?"},
  {"author": "@WashingtonPost", "message": "Report: CIA assessment suggests Maduro loyalists like Delcy Rodríguez are best positioned to maintain stability during the transition."},
  {"author": "@USNews", "message": "UN Security Council meeting erupts in shouting match as U.S. Ambassador Mike Waltz defends the 'surgical law enforcement operation.'"},
  {"author": "@France24_en", "message": "European leaders divided: France and Germany express 'grave concern' over military force while Poland supports the U.S. move."},
  {"author": "@MiamiHerald", "message": "Exiles in Doral celebrate: 'We never thought we’d see the day he was in a U.S. courtroom.' #VenezuelaLibre"},
  {"author": "@Just_Security", "message": "New Analysis: The 2026 raid on Caracas and its implications for 'Personal Immunity' of world leaders. #MaduroTrial"},
  {"author": "@AP_Politics", "message": "Fact Check: No evidence supports Trump’s claim that Maduro 'sent' Tren de Aragua gangs to terrorize the U.S. #PolitiFact"},
  {"author": "@TheGuardian", "message": "Maduro remains defiant in his first 30 minutes before a U.S. judge: 'I am a decent man. I am innocent.'"},
  {"author": "@ReutersWorld", "message": "As of Jan 6, 2026, Maduro is being held at the Metropolitan Detention Center in Brooklyn. The legal battle of the century begins."}
]