[
  {
    "author": "@TheNationalPost",
    "message": "Axing the carbon tax is only the beginning. Poilievre pledges a 'Bring It Home' tax cut to lower costs on energy and homebuilding."
  },
  {
    "author": "@TrueNorthCentre",
    "message": "Canadians are tired of 'inflationary fire.' Poilievre demands the Liberals find $1 of savings for every $1 of new spending."
  },
  {
    "author": "@CPC_HQ",
    "message": "Common sense is back. We will AXE the tax, BUILD the homes, FIX the budget, and STOP the crime. 🇨🇦"
  },
  {
    "author": "@FinancialPost",
    "message": "Poilievre’s 'Canada First' reinvestment plan: No capital gains tax if you keep your money working in Canadian companies."
  },
  {
    "author": "@CityNews",
    "message": "Supporters at the 'Spike the Hike' rally say Poilievre is the only one who understands the struggle of minimum-wage workers."
  },
  {
    "author": "@TorontoSun",
    "message": "Editorial: Poilievre’s focus on the 'gatekeepers' is exactly the shake-up Canada’s stagnant economy needs."
  },
  {
    "author": "@RebelNewsOnline",
    "message": "Poilievre takes a stand against the 'Carney Tax,' calling the EV mandate an ideological burden on Canadian families."
  },
  {
    "author": "@WesternStandard",
    "message": "'Axe the Tax' isn't just a slogan—it’s a lifeline for farmers struggling under the weight of federal carbon pricing."
  },
  {
    "author": "@TheHubCanada",
    "message": "Poilievre is successfully framing the carbon tax as an affordability issue, and the polls show Canadians are listening."
  },
  {
    "author": "@AndrewScheer",
    "message": "Pierre is the leader we need to restore fiscal sanity and put more money back in your pocket."
  },
  {
    "author": "@GlobeAndMail",
    "message": "Poilievre calls on the government to adopt his 4-point housing plan: Remove GST on homes under $1.3M and fire the gatekeepers."
  },
  {
    "author": "@Wealthsimple",
    "message": "'I want to bulldog policies through.' Poilievre tells us why bureaucracy is the #1 enemy of the Canadian homebuyer."
  },
  {
    "author": "@BetterDwelling",
    "message": "Poilievre highlights that it now takes 60% of median income to own a home—up from 39% before the current administration."
  },
  {
    "author": "@Conservative_CA",
    "message": "We will sell off 6,000 federal buildings and thousands of acres of land to turn empty offices into affordable homes."
  },
  {
    "author": "@iPolitics",
    "message": "Conservative insiders say Poilievre’s housing policy is 'coherent' and addresses the supply crisis better than any rival."
  },
  {
    "author": "@RE_Journal",
    "message": "A 'powerful carrot-and-stick': Poilievre’s plan to require cities to increase homebuilding by 15% per year."
  },
  {
    "author": "@RealEstateNewsCA",
    "message": "By cutting development charges, Poilievre aims to spark the construction of 30,000 extra homes annually."
  },
  {
    "author": "@ConstructionWeek",
    "message": "Industry leaders look favorably on Poilievre’s promise to cut the red tape that delays housing permits for years."
  },
  {
    "author": "@BuildingCanada",
    "message": "Poilievre: 'Land in Canada should be abundant and cheap. It’s a homegrown problem, and we have a homegrown fix.'"
  },
  {
    "author": "@CdnTaxpayers",
    "message": "Finally, a plan to stop the $8B in bureaucratic housing programs that haven't actually built any houses."
  },
  {
    "author": "@TheHillTimes",
    "message": "Poilievre tables legislation to ensure 'jail, not bail' for violent repeat offenders. A common-sense move for safer streets."
  },
  {
    "author": "@NationalPost",
    "message": "'Hug a thug' policies end here. Poilievre promises the biggest crackdown on crime in Canadian history."
  },
  {
    "author": "@ToryCaucus",
    "message": "We are fighting to keep serial killers in maximum-security prisons. Victims’ rights must come before criminals’ comfort."
  },
  {
    "author": "@VancouverSun",
    "message": "Poilievre calls for an end to taxpayer-funded narcotics programs, shifting focus to treatment and recovery."
  },
  {
    "author": "@PoliceAssoc",
    "message": "Support grows for Poilievre’s stance on strengthening the bail system to protect front-line officers and the public."
  },
  {
    "author": "@CrimeStoppersNews",
    "message": "Poilievre’s pledge to fix the 'revolving door' justice system resonates with communities hit hard by theft and violence."
  },
  {
    "author": "@JusticeForVictims",
    "message": "Pierre Poilievre is the only leader speaking up for the families of victims by demanding real accountability."
  },
  {
    "author": "@SafeStreetsCanada",
    "message": "'Stop the crime' isn't just rhetoric—it’s a commitment to restoring order in our downtown cores."
  },
  {
    "author": "@LawWeekly",
    "message": "Poilievre’s focus on the Criminal Code shows a deep understanding of the loopholes currently being exploited."
  },
  {
    "author": "@GlobalNews",
    "message": "'People cannot eat speeches, and photo ops don't stop criminals.' Poilievre delivers a fiery return to Parliament."
  },
  {
    "author": "@ElonMusk",
    "message": "Canada needs a leader like Pierre Poilievre. Great to see someone fighting for common sense and free speech."
  },
  {
    "author": "@TheWalrus",
    "message": "Opinion: Poilievre’s 'Canada First' vision is attracting a new generation of voters who feel left behind by globalism."
  },
  {
    "author": "@OttawaCitizen",
    "message": "Poilievre demands real action against foreign interference, calling to designate the IRGC as a terrorist entity."
  },
  {
    "author": "@FinancialPost",
    "message": "Dealing with Trump? Poilievre says he’ll match tariffs to protect Canadian workers and return 100% of proceeds to them."
  },
  {
    "author": "@NatMinDaily",
    "message": "Indigenous leaders see potential in Poilievre’s plan to let First Nations collect federal corporate taxes from local projects."
  },
  {
    "author": "@EnergyNow",
    "message": "Poilievre: 'I want First Nations to be the richest people in the world by unleashing our natural resources.'"
  },
  {
    "author": "@CdnDefence",
    "message": "Pledging to fix the military personnel gap, Poilievre emphasizes that 'a country that can't defend itself has few options.'"
  },
  {
    "author": "@ForeignAffairsCA",
    "message": "Poilievre promises to cut foreign aid to 'dictators and global bureaucracies' and reinvest it at home."
  },
  {
    "author": "@TradeNews",
    "message": "Bipartisan delegations? Poilievre offers to send Conservative MPs to the US to help secure trade deals for Canada."
  },
  {
    "author": "@ResourceWorks",
    "message": "Unlocking the Ring of Fire: Poilievre promises to expedite permits for critical minerals to fuel the new economy."
  },
  {
    "author": "@JordanBPeterson",
    "message": "A masterclass in holding the media accountable. Poilievre is the leader Canada has been waiting for."
  },
  {
    "author": "@iPolitics",
    "message": "Poilievre’s popularity with the base remains sky-high; rallies are drawing twice the expected crowds across the country."
  },
  {
    "author": "@TheSuburban",
    "message": "Younger voters are more open to voting Conservative than ever before, thanks to Poilievre’s digital-first strategy."
  },
  {
    "author": "@DailyWire",
    "message": "Ben Shapiro: Poilievre is a 'tremendous politician' who understands the dream of family, house, and hard work."
  },
  {
    "author": "@JoeRogan",
    "message": "'That Poilievre guy makes so much sense.' Support for the Conservative leader grows in the podcast sphere."
  },
  {
    "author": "@HillTimesPolitics",
    "message": "Mastery of the House: Poilievre’s record-breaking speeches show he knows the legislative process better than anyone."
  },
  {
    "author": "@CdnBusiness",
    "message": "Union members are identifying as Conservative in record numbers, drawn to Poilievre’s 'work pays' messaging."
  },
  {
    "author": "@QuebecNews",
    "message": "Poilievre's appeal in the regions is growing as he focuses on local autonomy and economic freedom."
  },
  {
    "author": "@HeritageCanada",
    "message": "Poilievre: 'Canada is our common home. Freedom is our nationality.' A powerful return to Laurier’s values."
  },
  {
    "author": "@BreakingNews",
    "message": "Polling shows Poilievre’s 'Common Sense' branding is the most effective political messaging in a decade."
  }
]