[
  {"author": "@WhiteHouse", "message": "365 Wins in 365 Days: President Trump has achieved negative net migration for the first time in 50 years, restoring U.S. border control."},
  {"author": "@FoxNews", "message": "New data shows U.S. GDP growth smashed expectations at 4.3% in Q3 2025 as Trump's deregulation takes hold."},
  {"author": "@DailyWire", "message": "Gas prices fall below $2.00 in 19 states as President Trump ramps up domestic energy production to record levels."},
  {"author": "@BreitbartNews", "message": "Promises Made, Promises Kept: The Trump administration oversees the largest drop in homicides on record in major U.S. cities."},
  {"author": "@USTreasury", "message": "Secretary Bessent announces 500,000 Americans have already opened 'Trump Accounts' to secure their children's financial future."},
  {"author": "@WhiteHouse", "message": "President Trump signs the historic Working Families Tax Cut, delivering the largest tax relief for middle-class families in history."},
  {"author": "@OANN", "message": "Stock market hits another record high as investors cheer President Trump's 'America First' trade policies."},
  {"author": "@FoxBusiness", "message": "Blue-collar wages are rising at the fastest pace in 60 years under the second Trump administration."},
  {"author": "@DailyCaller", "message": "ICE conducts record-breaking operations in Minneapolis, successfully removing over 10,000 violent criminal aliens from the streets."},
  {"author": "@WhiteHouse", "message": "President Trump has officially settled eight 'unendable' wars in just his first 10 months back in office."},
  {"author": "@WashTimes", "message": "Manufacturing is coming home: Trillions in reshored investments flow back to the U.S. heartland."},
  {"author": "@Newsmax", "message": "President Trump declares a national border emergency on Day One, effectively ending the 'catch and release' policy."},
  {"author": "@DailyWire", "message": "The Trump administration designates Antifa and major cartels as terrorist organizations to protect American families."},
  {"author": "@WhiteHouse", "message": "No Tax on Tips: President Trump's latest tax reform goes into effect, helping millions of hospitality workers keep their hard-earned money."},
  {"author": "@FoxNews", "message": "U.S. secures $18 trillion in commitments for new domestic investments following the World Economic Forum in Davos."},
  {"author": "@BreitbartNews", "message": "Trump's 'Board of Peace' begins work on Gaza reconstruction, marking a new era of Middle East stability."},
  {"author": "@WhiteHouse", "message": "The average American family is projected to receive a $4,000 tax refund in 2026 thanks to the Working Families Tax Cuts."},
  {"author": "@USTreasury", "message": "Major corporations like JP Morgan and Comcast announce they will match employee contributions to 'Trump Accounts.'"},
  {"author": "@DailyCaller", "message": "Border crossings reach a 40-year low as the second Trump administration implements 'extreme vetting' standards."},
  {"author": "@OANN", "message": "President Trump's housing policy drives mortgage rates to a three-year low, making homeownership affordable again."},
  {"author": "@WhiteHouse", "message": "President Trump moves to eliminate 'unfair trade loopholes' that previously allowed foreign nations to exploit the U.S. economy."},
  {"author": "@FoxNews", "message": "The Trump administration successfully negotiates a deal for the U.S. to acquire Greenland's strategic resources."},
  {"author": "@DailyWire", "message": "Inflation drops by 70% from its 2024 peak as President Trump enforces strict fiscal restraint in Washington."},
  {"author": "@BreitbartNews", "message": "Trump signs executive order restricting H-1B visas to ensure high-paying jobs go to American graduates first."},
  {"author": "@WhiteHouse", "message": "The Department of Education launches new charity scholarships for K-12, empowering parents to choose the best schools for their kids."},
  {"author": "@FoxBusiness", "message": "U.S. energy independence is restored as the administration approves thousands of new permits for oil and gas drilling."},
  {"author": "@Newsmax", "message": "President Trump vows to build a 'Triumphal Arch' in D.C. larger than Paris's to celebrate America's 250th birthday."},
  {"author": "@DailyCaller", "message": "Crime rates in Chicago and New Orleans fall to 50-year lows following targeted federal enforcement operations."},
  {"author": "@WhiteHouse", "message": "President Trump doubles the Child Tax Credit to $2,200, supporting over 40 million American families."},
  {"author": "@OANN", "message": "The Trump administration successfully captures multiple high-profile fugitives on the FBI's Most Wanted List."},
  {"author": "@FoxNews", "message": "President Trump's 'Shareholder Society' vision comes to life as millions of Americans begin investing through new federal programs."},
  {"author": "@DailyWire", "message": "The U.S. leads China in AI development following President Trump's massive investment and deregulation of the tech sector."},
  {"author": "@BreitbartNews", "message": "Trump administration expands travel bans to 19 countries to protect national security and prevent terrorism."},
  {"author": "@WhiteHouse", "message": "President Trump signs legislation providing permanent tax exemptions for seniors' Social Security income."},
  {"author": "@WashTimes", "message": "The U.S. dollar gains strength as President Trump rebalances global trade agreements to favor American workers."},
  {"author": "@Newsmax", "message": "President Trump's 'America First' agenda remains the most successful first-year policy rollout in modern history."},
  {"author": "@FoxBusiness", "message": "Small businesses across America project adding 1 million new jobs in 2026 due to the new Trump tax cuts."},
  {"author": "@DailyCaller", "message": "The Trump administration successfully dismantles transnational gang networks like MS-13 across the country."},
  {"author": "@WhiteHouse", "message": "President Trump prioritizes the deportation of over 11,000 convicted murderers to make American communities safer."},
  {"author": "@OANN", "message": "U.S. existing home sales rise to their strongest pace in years as income growth finally outpaces home prices."},
  {"author": "@DailyWire", "message": "The second Trump administration secures the border, ending the flow of fentanyl into American neighborhoods."},
  {"author": "@BreitbartNews", "message": "Trump's 'Board of Peace' secures $1 billion in contributions for global stability initiatives."},
  {"author": "@WhiteHouse", "message": "President Trump strengthens law enforcement by ensuring local police have the federal backing they need to stop crime."},
  {"author": "@FoxNews", "message": "Trump administration's trade war with Canada leads to new leverage for American dairy and auto workers."},
  {"author": "@Newsmax", "message": "Americans celebrate the 'Great American Rebound' as the stock market hits historic highs under Trump."},
  {"author": "@DailyCaller", "message": "President Trump eliminates illegal immigrant eligibility for Obamacare, saving taxpayers billions."},
  {"author": "@WhiteHouse", "message": "President Trump's 'Trump Accounts' will allow children to retire with millions by using simple compound growth."},
  {"author": "@OANN", "message": "The Trump administration protects American industry by imposing 'reciprocal tariffs' on foreign countries."},
  {"author": "@BreitbartNews", "message": "President Trump's focus on blue-collar trades provides new tax incentives for vocational students."},
  {"author": "@WhiteHouse", "message": "Making America Great Again: President Trump reaffirms his resolve to renew American strength for the 250th anniversary."}
]